Repository: 84000/data-translation-memory
Catalog: toh184-v2.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་ཁྱད་པར་ཅན་འདི་ལྟ་བུ་ནི་བསྐལ་པ་བྱེ་བ་ཕྲག་འབུམ་དུ་ཡང་རྙེད་པར་དཀའ་བས།
en: “Since it is difficult to meet such an extraordinary being even in a trillion eons,

source: ཁང་བཟངས་འདི་ལས་བདག་གིས་མཆོང་བར་བྱའོ་སྙམ་མོ། །
en: I should jump down from this house.”

source: དེ་ནས་དེའི་ཚེ་ཁྱེའུ་རིན་ཆེན་བྱིན་གྱིས་རིལ་གྱིས་གསེར་ལས་བྱས་པའི་པད་མ་འདབ་མ་འབུམ་དང་ལྡན་པ་བརྩེན་པ་ལག་མཐིལ་དུ་ཁྱེར་རོ། །
en: With that thought, Ratnadatta placed his toy, a golden lotus with a hundred thousand petals, in the palm of his hand

source: དེ་ནས་ཁྱེའུ་རིན་ཆེན་བྱིན་གྱིས་ཁང་བཟངས་དེ་ལས་བདག་ཉིད་ཀྱིས་མཆོངས་སོ། །
en: and [With that thought, Ratnadatta placed his toy, a golden lotus with a hundred thousand petals, in the palm of his hand and] jumped off the house.

source: དེ་སངས་རྒྱས་ཀྱི་མཐུས་ནམ་མཁའ་བར་སྣང་ལ་འདུག་གོ། །
en: However, due to the Buddha’s power, he remained floating in midair.

source: དེ་ནས་ཁྱེའུ་རིན་ཆེན་བྱིན་གྱིས་རིལ་གྱིས་གསེར་ལས་བྱས་པའི་པད་མ་འདབ་མ་འབུམ་དང་ལྡན་པ་དེ་བཅོམ་ལྡན་འདས་ལ་ཕུལ་ལོ། །
en: Ratnadatta then offered the golden lotus with a hundred thousand petals to the Blessed One.

source: དེ་ཁྱེའུ་རིན་ཆེན་བྱིན་གྱི་ལག་ནས་བཏང་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དབུའི་དྲང་ཐད་ཀྱི་སྟེང་གི་ནམ་མཁའ་བར་སྣང་ལ་པད་མའི་གདུགས་སུ་བྱས་ཏེ་རིན་པོ་ཆེའི་དྲ་བ་ཡང་བྲེས་སོ། །
en: As soon as Ratnadatta let go of the lotus, the Blessed One transformed it into a lotus parasol adorned with a net of jewels, and it hovered in the sky directly above the Blessed One’s head.

source: དེ་ནས་དེའི་ཚེ་ཁྱེའུ་རིན་ཆེན་བྱིན་གྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: When that happened, the boy Ratnadatta recited the following verses:

source: སངས་རྒྱས་པད་མ་འདི་ཕུལ་བ། །བདག་ནི་ཅི་ཡང་མི་འཚལ་ཏེ། །
en: “I offer this lotus to the Buddha Seeking nothing in return—

source: དོན་རྣམས་ཐམས་ཅད་བཅད་སླད་དུ། །བདག་ནི་བྱང་ཆུབ་མཆོག་འཚལ་ལོ། །
en: To eliminate all goals. I seek supreme awakening

source: ཇི་ལྟར་བྱང་ཆུབ་མ་སྐྱེས་ལ། །ཐོབ་པ་མ་མཆིས་བཤིག་མ་མཆིས། །
en: “Since in unborn awakening There is nothing to gain or lose

source: བླང་དུ་མ་མཆིས་དོར་མ་མཆིས། །དེ་ལྟར་བདག་གིས་མེ་ཏོག་དབུལ། །
en: And nothing to accept or reject, I offer this flower.

source: བྱིས་པ་རྣམས་ཀྱིས་དོན་གང་བརྟགས། །བརྟགས་པ་དེ་ནི་དོན་མ་མཆིས། །
en: That childish beings construct is pointless. “The conception of value

source: རྟོག་པ་ཐམས་ཅད་བཅད་སླད་དུ། །གང་ཟག་མཆོག་ལ་བདག་མཆོད་བགྱིད། །
en: So that I may eliminate all conceptual thought. I make this offering to the supreme human being

source: དེ་ཕྱིར་མེ་ཏོག་ཕུལ་བ་འདི། །བདག་ལ་རྣམ་སྨིན་འབྲས་མ་གྱུར། །
en: “I do not offer this flower So that a result will ripen for me.

source: དངོས་པོ་ཐམས་ཅད་བཅད་སླད་དུ། །པད་མ་འདི་ནི་བདག་གིས་ཕུལ། །
en: To eliminate all existent things. I offer this lotus blossom

source: བདག་གི་སངས་རྒྱས་ཞིང་དུ་ནི། །རྒྱལ་མཆོག་ཐེག་པས་འགྲོ་མ་གཏོགས། །
en: “In my buddha realm One will follow only the vehicle of the supreme victor—

source: ཉན་ཐོས་ཀྱི་ནི་མིང་ཡང་རུང་། །རང་རྒྱལ་མིང་ཡང་འབྱུང་མ་གྱུར། །
en: May even the names hearer or solitary buddha Not arise there.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་ཁྱེའུ་རིན་ཆེན་བྱིན་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Then, Venerable Mahā­maudgalyā­yana recited the following verse to the boy Ratnadatta:

source: ཁྱོད་ནི་སྟོན་པ་འདི་འདྲ་ལ། །དད་པས་མཆོད་པ་བྱེད་མོད་ཀྱི། །བློ་གྲོས་ཕྱིན་ཅི་ལོག་གྱུར་ནསངས་རྒྱས་སུ་ནི་ཇི་ལྟར་འགྱུར། །
en: “Although you make this offering Out of faith in such a teacher, Your understanding is mistaken. How, then, will you become a buddha?”

source: དེ་ནས་ཁྱེའུ་རིན་ཆེན་བྱིན་གྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Ratnadatta replied to Venerable Mahā­maudgalyā­yana with the following verses:

source: འདི་དག་ཐམས་ཅད་མ་སྐྱེས་ཏེ། །
en: “All these entities are unborn.

source: འདུས་བྱས་དག་ནི་གསོབ་དང་གསོག །
en: Conditioned things are hollow and void.

source: དེ་འདྲ་བ་ཡི་ཆོས་རྣམས་ལ། །དངོས་པོར་འགྱུར་བ་ག་ལ་ཡོད། །
en: How could such phenomena Have any substance?

source: ཁྱོད་ནི་ཆོས་གོས་ངུར་སྨྲིག་བགོས། །
en: “You wear saffron monastic robes

source: དགྲ་བཅོམ་ཉིད་དུ་འཛིན་པར་བྱེད། །
en: And grasp at the state of a worthy one,

source: རྣམ་ཤེས་འདི་དག་སྤྱོད་ཡུལ་ཡང་། །
en: But aren’t consciousness and its domain

source: སྟོང་པ་ཁོ་ན་མ་ཡིན་ནམ། །
en: Simply empty?

source: དམིགས་པ་ལ་ནི་གནས་བཅས་པས། །སངས་རྒྱས་བྱེ་བ་མ་མཉེས་བྱས། །
en: “The millions of buddhas are not pleased By having recourse to apprehension.

source: བྱེ་བ་དེ་ཡང་ཞི་བར་མཐོང་། །
en: Those millions perceive only quiescence,

source: སུ་ཡང་མ་མཉེས་བྱས་པ་མེད། །
en: And there is not one of them who does not find joy in that.

source: མཽད་གལ་བུ་ལ་ད་དུང་ཡང་། །དམིགས་པ་འཇུག་པ་ཡོད་དམ་ཅི། །
en: “Maudgalyā­yana, do you still Engage in apprehension?

source: ཁྱོད་ཀྱི་སེམས་ནི་གང་ཞིག་གིས། །
en: Can someone who thinks as you do

source: ཡོན་ཡང་ཡོངས་སུ་སྦྱོང་བར་བྱེད། །
en: Even purify a gift?”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་ཁྱེའུ་རིན་ཆེན་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Venerable Mahā­maudgalyā­yana replied to Ratnadatta, saying,

source: ཁྱེའུ་ཅི་དེ་བཞིན་གཤེགས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་སམ། ཆོས་ཀྱང་མ་བསྟན་ཏམ། ཁྱེའུ་རིན་ཆེན་བྱིན་གྱིས་སྨྲས་པ།
en: “Child, tell me, has the Thus-Gone One not become a complete buddha who has manifested unsurpassed and perfect awakening? Furthermore, has he not taught the Dharma?”

source: མཽད་གལ་གྱི་བུ་མཁས་པས་ནི་བྱང་ཆུབ་སྤྲོས་པར་མི་བྱའོ། །དེ་བཞིན་གཤེགས་པ་ཡང་རློམ་སེམས་སུ་མི་བྱའོ། །
en: “Maudgalyā­yana,” Ratnadatta replied, “a wise person should not conceptualize awakening or formulate opinions about the Thus-Gone One.

source: ཆོས་མི་སྐྱེའོ་སྙམ་དུ་བརྟག་པར་མི་བྱའོ། །
en: They should not impute concepts such as the thought that phenomena do not arise,

source: ཆོས་ཐམས་ཅད་འདུས་བྱས་སོ་སྙམ་དུ་བརྟག་པར་མི་བྱའོ། །
en: the thought that all phenomena are conditioned, or

source: ཆོས་ཐམས་ཅད་འདུས་མ་བྱས་སོ་སྙམ་དུ་བརྟག་པར་མི་བྱའོ། །
en: the thought that all phenomena are unconditioned.

source: དེ་བཞིན་དུ་སྦྱར་ཏེ་ཆོས་ཐམས་ཅད་སྐྱེ་བ་དང་། མི་སྐྱེ་བ་དང་། དངོས་པོ་དང་། དངོས་པོ་མེད་པ་ཞེས་བྱ་བ་དང་། འཛིན་པ་དང་། གཏོང་བ་ཞེས་བྱ་བ་དང་། ཕྲད་པ་དང་བྲལ་བ་ཞེས་བྱ་བ་དང་། འགྲོ་བ་དང་། འོང་བ་དང་། གནས་པ་དང་། འཕོ་བ་དང་། འདོད་ཆགས་ཀྱི་ཆོས་དང་། ཞེ་སྡང་གི་ཆོས་དང་། གཏི་མུག་གི་ཆོས་དང་། ཆོས་དང་། ཆོས་མ་ཡིན་པ་ཞེས་བརྟག་པར་མི་བྱའོ། །
en: They should not impute concepts such as ‘all phenomena arise, do not arise, are existent, or are nonexistent,’ ‘grasping and letting go,’ ‘meeting and separating,’ ‘going, coming, remaining, transmigrating, phenomena associated with attachment, hatred, and delusion, and right and wrong.’

source: མ་རིག་པ་ལ་སོགས་པ་ནས་སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་དང་། ཉན་ཐོས་ཀྱི་ཆོས་རྣམས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་ཆོས་རྣམས་དང་། རྣམ་པར་བྱང་བའི་ཆོས་རྣམས་དང་། གཟུགས་ཅན་དང་། གཟུགས་ཅན་མ་ཡིན་པ་དང་། འདུ་ཤེས་དང་། འདུ་ཤེས་མེད་པ་དང་། མཚན་ཉིད་དང་། མཚན་ཉིད་མེད་པ་དང་། སྤྱོད་པ་ཡོངས་སུ་དག་པ་དང་། མཉམ་པ་ཉིད་དང་། མི་མཉམ་པ་ཉིད་དང་། ལུས་དང་། སེམས་དང་། ཆོས་ཐམས་ཅད་ཚུལ་བཞིན་དང་། ཚུལ་བཞིན་མ་ཡིན་པ་ཞེས་བྱ་བའི་བར་དུ་སྐྱེ་བར་འགྱུར་རོ། །ཞེས་བརྟག་པར་མི་བྱའོ། །
en: They should not impute the concept that ‘ignorance and the like up to and including the qualities of hearers, the qualities of solitary buddhas, the qualities of the buddhas, the factors of pollution, the factors of purification, the physical and nonphysical, perception and lack of perception, marks and lack of marks, pure conduct, sameness, difference, body, mind, and all correct and incorrect qualities arise.’

source: མཽད་གལ་གྱི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའམ། སྨྲས་པ།
en: So you tell me, Maudgalyā­yana—do you think the thus-gone ones are complete buddhas who manifest unsurpassed and perfect awakening?”

source: དེ་ནི་མ་ཡིན་ནོ། །སྨྲས་པ།
en: Maudgalyā­yana replied, “That is not the case.”

source: ཅི་དེ་བཞིན་གཤེགས་པ་དེ་བཞིན་ཉིད་ལ་མ་གཏོགས་པ་དང་། བྱང་ཆུབ་དེ་བཞིན་ཉིད་ལ་མ་གཏོགས་པ་དང་། སོ་སོའི་སྐྱེ་བོ་དེ་བཞིན་ཉིད་ལ་མ་གཏོགས་པར་འདོད་མ།
en: The boy said, “Do you assert that the thus-gone ones are not included in suchness, that awakening is not included in suchness, or that ordinary beings are not included in suchness?”

source: མཽད་གལ་གྱི་བུས་སྨྲས་པ། དེ་ནི་མ་ཡིན་ནོ། །
en: Maudgalyā­yana said, “That is not the case.”

source: ཁྱེའུས་སྨྲས་པ། མཽད་གལ་གྱི་བུ་ཁྱོད་སྤྲོས་པ་མེད་པ་ལ་སྤྲོས་པར་བྱེད་མ།
en: “Maudgalyā­yana,” the boy responded, “do you conceptualize the lack of conceptualization?”

source: མཽད་གལ་གྱི་བུས་སྨྲས་པ། ཁོ་བོ་ནི་འཇིག་རྟེན་གྱི་ཀུན་རྫོབ་ཀྱི་སྒོ་ནས་སྟོན་ཏོ། །
en: “I teach by means of the conventions of the world,” Maudgalyā­yana replied.

source: ཁྱེའུས་སྨྲས་པ། མཽད་གལ་གྱི་བུ་འཇིག་རྟེན་ནི་བརྫུན་པ། སླུ་བ་སྒྱུ་མའི་རྣམ་པ། བྱིས་པ་འདྲིད་པར་བྱེད་པའོ། །
en: The boy continued, “Maudgalyā­yana, the world is a fake, deceptive, and illusory appearance that tricks childish beings.”

source: མཽད་གལ་གྱི་བུས་སྨྲས་པ། གལ་ཏེ་འཇིག་རྟེན་འདི་བརྫུན་པ་སླུ་བའི་ཆོས་ཅན་ཡིན་པ་དང་བསྟན་པ་འདི་ཡང་བརྫུན་པ། སླུ་བའི་ཆོས་ཅན་ཡིན་ན་ཁྱོད་ཅིའི་ཕྱིར་སྟོན་པར་བྱེད། སྨྲས་པ།
en: “Maudgalyā­yana,” answered the boy, [the world is a fake, deceptive, and illusory appearance] "phenomena cannot be demonstrated.

source: མཽད་གལ་གྱི་བུ་ཆོས་ཐམས་ཅད་ནི་བསྟན་དུ་མེད་པ་སྟེ།
en: “If the world is a fake and deceptive phenomenon,” said Maudgalyā­yana, “then this teaching is also a fake and deceptive phenomenon. Why, then, do you teach it?”

source: དེ་དག་ནི་བསྟན་པར་བྱ་བ་མ་ཡིན། ཐོབ་པར་བྱ་བ་མ་ཡིན། མངོན་སུམ་དུ་བྱ་བ་མ་ཡིན། སྤང་བར་བྱ་བ་མ་ཡིན། ཡོངས་སུ་ཤེས་པར་བྱ་བ་མ་ཡིན། བསྒོམ་པར་བྱ་བ་མ་ཡིན་ནོ། །
en: They cannot be demonstrated, attained, actualized, abandoned, understood, or meditated upon.”

source: མཽད་གལ་གྱི་བུས་སྨྲས་པ། འོ་ན་ཁྱོད་ཀྱིས་གང་གི་དོན་དུ་དེ་བཞིན་གཤེགས་པ་མཆོད།
en: Maudgalyā­yana replied, “If that is the case, what is the point of you making an offering to the Thus-Gone One?”

source: ཁྱེའུས་སྨྲས་པ། མཽད་གལ་གྱི་བུ་ཁྱོད་དེ་བཞིན་གཤེགས་པའམ། སྦྱིན་པ་པོའམ། སྦྱིན་པར་དམིགས་སམ།
en: “Maudgalyā­yana,” the boy asked, “do you apprehend a Thus-Gone One, someone who gives a gift, or an act of giving?”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཅང་མི་སྨྲ་བར་གྱུར་ཏོ། །
en: Venerable Maudgalyā­yana remained silent,

source: ཁྱེའུ་རིན་ཆེན་བྱིན་གྱིས་སྨྲས་པ། མཽད་གལ་གྱི་བུ་བདག་གིས་དེ་ལས་བསམས་ནས་དེ་བཞིན་གཤེགས་པར་འགྱུར་བ་ཡོངས་སུ་སྤངས་ཏེ།
en: so the boy Ratnadatta continued, “Maudgalyā­yana, with this in mind, I have given up becoming a thus-gone one and

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་སེམས་སྐྱེད་པར་བྱེད་པ་གང་དག་ཡིན་པ་དེ་དག་ནི་རྙེད་པ་ཉེས་པར་རྙེད་པའོ་ཞེས་དེ་སྐད་ཀྱི་ཚིག་སྨྲས་སོ། །
en: say those who form the resolve set on the vehicle of the hearers ‘are indeed unfortunate.’ ”

source: མཽད་གལ་གྱི་བུས་སྨྲས་པ།
en: Maudgalyā­yana replied,

source: ཁྱོད་ནི་ན་ཚོད་ཤིན་ཏུ་གཞོན། །
en: “You are very young,

source: ཤེས་རབ་ཀྱིས་ནི་རྒྱ་མཚོ་བཞིན། །
en: Yet your insight is vast as the ocean.

source: ཁྱོད་ཀྱིས་ཇི་སྲིད་ཙམ་ཞིག་ནས། །ཆོས་འདི་དག་ལ་བསླབས་པར་གྱུར། །
en: How long have you been Trained in these teachings?”

source: ཁྱེའུ་རིན་ཆེན་བྱིན་གྱིས་སྨྲས་པ།
en: Ratnadatta replied with the following verses:

source: བསླབ་པ་ཐམས་ཅད་རྣམ་འཇིག་པ། །
en: “All training perishes.

source: བསླབ་པ་གང་ཡིན་དེ་བསླབ་མིན། །
en: Training is not training.

source: གང་ལ་བསླབ་པ་མེད་པ་དེ། །མཁས་པ་རྣམས་ཀྱི་བསླབ་པ་ཡིན། །
en: Consists in being one who lacks training. The training of the wise ones

source: དོན་གང་ཁྱོད་ཀྱིས་བདག་དྲིས་པ། །
en: “The question ‘what is the point?’ that you asked me

source: སེམས་ཅན་འདུ་ཤེས་གནས་པ་སྟེ། །
en: Is based upon the perceptions of beings,

source: འདིར་ནི་ཆོས་རྣམས་ཐམས་ཅད་ལ། །
en: Any phenomena arising anywhere.

source: གང་ལའང་སྐྱེ་བ་མི་རྙེད་དོ། །
en: And to this I say one does not find

source: བྱིས་པ་རྣམས་ནི་བྱང་ཆུབ་དང་། །འཁོར་བ་ཉིད་དུ་རྟོག་པར་བྱེད། །
en: “Childish beings conceptualize Both awakening and cyclic existence.

source: འདིར་ནི་ད་དུང་བཙུན་པ་ཁྱོད། །བྱིས་པའི་ཆོས་ལ་འབྲང་ངམ་ཅི། །
en: So do you, Venerable One, Still follow the way of childish beings?

source: རིང་པོའམ་ཡང་ན་ཐུང་ངུ་ཞེས། །མཁས་པ་དག་ནི་རྟོག་མི་བྱེད། །ཆོས་ཀུན་སྙིང་པོ་མེད་པར་ནི། །དེ་བཞིན་དེ་དག་ཁོང་དུ་ཆུད། །
en: “Since they understand That all phenomena lack essence, The wise do not generate Concepts such as ‘near’ and ‘far.’

source: བྱིས་པའམ་བྱིས་པའི་ཆོས་རྣམས་སམ། །སངས་རྒྱས་ཆོས་སམ་རྒྱལ་བའང་རུང་། །བློ་ལྡན་ཐ་དད་མི་འབྱེད་ཀྱིས། །
en: “Intelligent ones do not differentiate Between childish beings and their qualities, Or the buddhas’ qualities and the victors,

source: སྟོང་པ་ཉིད་ལ་དེ་ལྟར་ལྟོས། །
en: So you too should see these as merely empty.

source: དྲང་སྲོང་ཆེན་པོས་བྱང་ཆུབ་ཐོབ། །
en: “That the great sage attained awakening

source: དེ་ནི་མི་རིགས་བརྟགས་པ་ཡིན། །
en: Is an illogical imputation.

source: ཆོས་འདི་ལ་ནི་སྐྱེ་མེད་ན། །མྱ་ངན་འདས་པ་ཇི་ལྟར་ཐོབ། །
en: If the phenomenon of awakening does not arise, How can one attain nirvāṇa?

source: ཆོས་རྣམས་མཐའ་ཡས་རབ་ཏུ་གསུངས། །
en: “An infinite number of teachings are proclaimed,

source: སེམས་ཅན་གྲོལ་བའང་དངོས་པོ་མེད། །
en: Yet there is no such thing as the liberation of beings.

source: མྱ་ངན་འདས་དང་འཁོར་བ་ལ། ཐ་དད་དབྱེར་མེད་གཟུང་བར་གྱིས། །
en: Between nirvāṇa and saṃsāra. Understand this: there is no distinction

source: འདི་ལ་རྣམ་པ་ཐམས་ཅད་དུ། །བསྣན་དང་དབྲི་བ་ཅི་ཡང་མེད། །
en: “Thus, in all cases, There is never any increase or decrease.

source: ཐ་དད་མེད་པའི་ཆོས་རྣམས་ལ། །མཁས་པ་རྣམས་ནི་རྨོངས་མི་འགྱུར། །
en: About the fact that phenomena are indistinct. The wise harbor no delusions

source: བྱིས་པ་རྣམས་ཀྱིས་ཐོབ་ཅིང་རྙེད། །
en: “Childish beings obtain and attain.

source: བྱིས་པས་མྱ་ངན་འདས་པ་ཐོབ། །
en: A childish being who attains nirvāṇa

source: འཁོར་བ་ལ་ནི་དེ་ཀུན་ཆགས། །
en: Is thoroughly attached to saṃsāra.

source: རློམ་སེམས་བདུད་ཀྱི་འཆིང་བ་ཡིན། །
en: Such conceited thinking is Māra’s trap.

source: གང་གིས་བློ་ལ་ངས་ཐོབ་སྙམ། །དེས་ནི་ཅི་ཡང་ཐོབ་པ་མེད། །
en: “Someone who thinks ‘I have attained’ Has not attained anything at all.

source: དེ་ཡི་ཡང་སྲིད་འགྲོ་བ་ཡི། །
en: They will proceed to their next birth

source: མ་རིག་པ་ཡང་འཇུག་པར་འགྱུར། །
en: And start all over again in ignorance.

source: བྱང་ཆུབ་སྙིང་པོར་འདུག་ནས་ནི། །མཐོང་བ་མེད་ཅིང་སྤངས་པའང་མེད། །
en: “Abiding at the seat of awakening, There is nothing to see and nothing to abandon.

source: སངས་རྒྱས་རྣམས་ཀྱི་བྱང་ཆུབ་འདི། །ཐ་སྙད་ཡིན་ཏེ་དོན་དུ་མིན། །
en: The awakening of all the buddhas Is a conventional term but nothing in actuality.

source: བྱང་ཆུབ་དང་ནི་མྱ་ངན་འདས། །ཐ་སྙད་དག་གིས་བརྗོད་མི་ནུས། །
en: “Awakening and nirvāṇa Cannot be expressed by conventional terms.

source: གང་དག་དེ་ལྟར་ཡང་དག་མཐོང་། །དེ་དག་ཆོས་ཉིད་རྣམ་པར་ཤེས། །
en: Those who see correctly in that way Fully understand the nature of reality.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Venerable Śāriputra then asked the Blessed One,

source: བཅོམ་ལྡན་འདས་ཁྱེའུ་རིན་ཆེན་བྱིན་གྱིས་ཡུན་ཇི་སྲིད་ཅིག་ནས་ཆོས་འདི་ལ་སྤྱད་ལགས།
en: “Blessed One, how long has this boy Ratnadatta practiced this teaching?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One replied,

source: གང་གི་ཚེ་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་ང་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་འགྱུར་བ་ལུང་བསྟན་པ་དེའི་ཚེ།
en: “When the thus-gone one Dīpaṁkara gave his prophecy that I would attain acceptance of the nonarising of phenomena,

source: འདི་མར་མེ་མཛད་ཀྱི་གསུང་རབ་ལ་སྟོང་པ་ཉིད་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མཆོག་ཏུ་གྱུར་ཏོ། །
en: at that point he was foremost among those bodhisattvas who abided in emptiness according to Dīpaṁkara’s teachings.

source: གང་གི་ཚེ་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་དང་པོ་སེམས་བསྐྱེད་པ་དེའི་ཚེ་འདིས་བཟོད་པ་ཐོབ་ནས་བསྐལ་པ་སུམ་འབུམ་ལོན་ནོ། །
en: At the moment when I first generated the mind set on unsurpassed and perfect awakening, three hundred thousand eons had passed since he attained acceptance.”

source: ཤཱ་རིའི་བུས་གསོལ་པ།
en: “Blessed One,” asked Śāriputra,

source: བཅོམ་ལྡན་འདས་ཁྱེའུ་རིན་ཆེན་བྱིན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་པའི་རྒྱུ་ནི་གང་ལགས། རྐྱེན་ནི་གང་ལགས།
en: “what cause and what conditions are responsible for the boy Ratnadatta not becoming a complete buddha who has manifested unsurpassed and perfect awakening?”

source: ཁྱོད་ཀྱིས་ཁྱེའུ་རིན་ཆེན་བྱིན་འདི་ཉིད་ལ་དྲིས་ཤིག་དང་འདི་ཉིད་ཀྱིས་ཁྱོད་ལ་སྟོན་པར་འགྱུར་རོ། །
en: “You should ask Ratnadatta himself this question. He will tell you,” the Blessed One responded.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཁྱེའུ་རིན་ཆེན་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: So Venerable Śāriputra asked the boy Ratnadatta,

source: ཅིའི་ཕྱིར་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས།
en: “Why have you not become a complete buddha who has manifested unsurpassed and perfect awakening?”

source: རིན་ཆེན་བྱིན་གྱིས་སྨྲས་པ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མ་དམིགས་པས་ན་དེའི་ཕྱིར་བདག་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱའོ། །
en: “The reason I do not become a complete manifest buddha,” Ratnadatta replied, “is that I do not apprehend unsurpassed and perfect awakening.”

source: ཤཱ་རིའི་བུས་སྨྲས་པ། འོ་ན་ཅི་དེ་བཞིན་གཤེགས་པ་འདི་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ལས་ན་དམིགས་པ་ལ་སྤྱོད་དམ།
en: “If that is so,” Śāriputra asked, “since this thus-gone one is a complete manifest buddha, do you apprehend him?”

source: རིན་ཆེན་བྱིན་གྱིས་སྨྲས་པ། གལ་ཏེ་དེ་བཞིན་གཤེགས་པ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་འཛིན་ན་ནི།
en: Ratnadatta replied, “If someone grasps at the Thus-Gone One as a complete manifest buddha, and

source: དེའི་དམིགས་པར་འགྱུར་བ་ཞིག་ན།
en: if he becomes the referent object of that grasping, then

source: ཆོས་གསུང་བ་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་ཡང་མི་མཛད་ལ་སྤོང་བར་ཡང་མི་མཛད་དོ། །
en: the Dharma he teaches will not cause that person to become a complete manifest buddha, and it will not even bring about renunciation.”

source: ཤཱ་རིའི་བུས་སྨྲས་པ། ཁྱོད་ཆོས་བཞི་སྒྲུབ་པ་དང་ཡོངས་སུ་སྨིན་པ་མཉམ་པས་བཟོད་པ་གང་ལ་གནས།
en: “Since you equate complete maturation with accomplishing the four factors, what is your acceptance based on?” Śāriputra asked.

source: བདག་གིས་ནི་ཆོས་གཅིག་ཀྱང་ཡོངས་སུ་གྲུབ་པར་ཡང་དག་པར་མ་མཐོང་ན་བཞི་ལྟ་ཅི་སྨོས།
en: “I do not perceive even a single phenomenon that is truly established, much less four.

source: འདི་ལ་ཡང་དག་པར་གྲུབ་པ་གང་ཞིག་ཡོད་དེ།
en: What is there truly established in them?

source: ཆོས་རྣམ་པར་རིག་པ་ཞེས་བྱ་བ་འདི་ནི་དམིགས་པའོ། །
en: ‘Knowing the Dharma’ is apprehension.

source: བྱང་ཆུབ་ཅེས་བྱ་བ་འདི་ནི་དམིགས་པའོ། །
en: ‘Awakening’ is apprehension.

source: དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་འདི་ནི་འཛིན་པའོ། །
en: ‘The Thus-Gone One’ is grasping.

source: གྲོལ་བ་ཞེས་བྱ་བ་འདི་ནི་སྤྲོས་པའོ། །
en: ‘Liberation’ is a mental construct.”

source: ཤཱ་རིའི་བུས་སྨྲས་པ། རིགས་ཀྱི་བུ་ཁྱོད་འདི་ལྟ་བུའི་ཆོས་རྣམས་ལ་སྤྱོད་ལ་རྫུས་ཏེ་
en: “Son of the lineage,” Śāriputra replied, “what a wonder that you experience things in this way and

source: སྐྱེ་བས་སངས་རྒྱས་རྣམས་མངོན་སུམ་དུ་གྱུར་པར་སྐྱེ་ཞིང་རྟག་ཏུ་རབ་ཏུ་འབྱུང་བ་འདི་ནི་ངོ་མཚར་ཏོ། །
en: that you have attained such a miraculous birth whereby you were born in the presence of the buddhas and will always go forth!”

source: སྐྱེ་དང་དེ་བཞིན་སྐྱེ་མེད་གཉིས་ནི་སྤྲོས་པ་སྟེ། །
en: “Born and not born are both mental constructs.

source: ཀུན་ཏུ་རྟོགས་པའི་ས་དང་བདུད་ཀྱི་སྤྱོད་ཡུལ་ཡིན། །
en: They are the level of conceptual imputation and the domain of Māra.

source: ལུས་ལ་སོགས་པའི་ཆོས་འཛིན་རློམ་སེམས་འདོད་པ་ཡི། །ལྷ་དང་ལྷ་མིན་འགྲོ་བ་རྣམས་ནི་འདིར་བརླག་གོ། །
en: Desire realm beings such as the gods and asuras who grasp at And harbor conceit about phenomena such as the body are destroyed in this domain.

source: རྒྱལ་བས་བདུད་རྩི་འདུས་མ་བྱས་པ་བརྙེས་སྙམ་དུ། །
en: “Thinking, ‘The Victor attained the unconditioned, deathless state,’

source: དེ་ལྟར་གང་དག་བསམ་པ་རབ་ཏུ་འཇུག་བྱེད་པ། །
en: Some set out with the same intention

source: དེ་དག་སངས་རྒྱས་ལ་ནི་སྐུ་ངས་གསོལ་བར་བྱེད། །
en: And insult the buddhas.

source: བརྙེས་ཀྱང་འདི་ལ་འདྲེན་པ་རྣམས་ཀྱིས་བརྙེས་པ་མེད། །
en: Though they attain it, there is nothing in it that the guides attain.

source: འདིར་ནི་སྐྱེ་བོ་མང་པོ་དག །རབ་ཏུ་བྱུང་ནས་རང་བྱུང་རློམ། །
en: “There are many people who, Having gone forth for this, presume they have gone forth.

source: སེམས་ཀྱི་དམིགས་པས་རྣམ་འཁྲུལ་ནས། །བསྟན་པ་ལ་ནི་སུན་འབྱིན་རྣམས། །
en: They are confused by mental apprehension And they corrupt the teachings.

source: བདུད་རྩི་བདག་གིས་ཐོབ་བོ་ཞེས། །ཐོབ་པའི་ང་རྒྱལ་ཅན་དག་སྨྲ། །
en: “Those who are proud of their attainment say, ‘I have attained deathlessness.’

source: སྐྱོབ་པ་ཤཱཀྱ་སེང་གེ་ཡི། །བསྟན་པ་ལ་ནི་སྤྲོས་མེད་པ། །
en: But the teaching of the protector, the lion of the Śākya clan, Lacks mental constructs.

source: སེམས་ཀྱིས་རྣམ་པ་ཐམས་ཅད་དུ། །སེམས་ཀྱིས་ངོ་བོ་ཉིད་མི་རྟོགས། །
en: “Among all mental content One does not find the nature of mind.

source: དེ་བཞིན་རྣམ་འདྲེན་གསུངས་པ་ཡི། །ལྟ་བ་དེ་ནི་རང་བཞིན་མེད། །
en: Thus, the view taught by the guide Has no inherent nature.

source: སྤྱན་དག་རྒྱལ་བས་གསུངས་པ་ཡི། །ལྟ་བ་ལ་ནི་ལྟ་བ་མེད། །
en: “In the view taught by the Victor with pure vision There is no viewing.

source: དེ་ཕྱིར་ཤེས་རབ་ལྡན་པ་ནི། །བདག་ཉིད་གྲོལ་སྙམ་འཛིན་པ་མེད། །
en: That is why those who have insight Do not grasp at the thought, ‘I am free.’

source: མཚན་མར་འཛིན་པ་སྒོམ་པ་རྣམས། །བདག་ཏུ་དམིགས་པས་རྨོངས་པར་འགྱུར། །
en: “Those accustomed to apprehending marks Apprehend a self and are deluded.

source: མཁས་པ་མ་ཡིན་ཁ་ཅིག་ནི། །ཡང་དག་མ་ཡིན་སྟོང་པ་སྤོང་། །
en: Such unwise people Reject emptiness as incorrect.

source: དངོས་པོ་རྨི་ལམ་སྒྱུ་མ་འདྲ། །རང་གི་བློས་ནི་བརྟགས་ནས་ཀྱང་། །
en: “The unwise impute things With their own minds,

source: མི་མཁས་དེ་དག་དངོས་པོ་རྣམས། །གཞིག་ཕྱིར་མྱ་ངན་འདས་པ་སྨྲ། །
en: Like a dream and an illusion. Then, when things cease, they call it nirvāṇa.

source: ལུས་ལ་ཡང་ནི་རྟེན་བཅས་ནས། །
en: “They take the body as a support

source: ཚུལ་ཁྲིམས་འདུ་ཤེས་རྣམ་པར་འཇིག །
en: And do away with the notion of discipline.

source: སེམས་ཀྱི་དམིགས་པ་དག་ལ་ཡང་། །
en: They take mental apprehention as a support

source: བསམ་གཏན་འདུ་ཤེས་རྣམ་པར་འཇིག །
en: And do away with the notion of meditative absorption.

source: དེ་བཞིན་ཤེས་རབ་དམིགས་ནས་ཀྱང་། །
en: “Likewise, they apprehend insight

source: ས་བོན་འདུ་ཤེས་རྣམ་པར་རྨོངས། །
en: And have a deluded notion of it as a seed.

source: འཇིག་རྟེན་འཇིག་རྟེན་མཁས་རྣམས་ཀྱིས། །
en: The wise people of the world

source: དེ་དག་ཆོས་ཀྱི་རྐུན་པོར་བརྗོད། །
en: Proclaim them thieves of the Dharma.

source: འདི་འདྲ་བ་ཡི་ཆོས་རྣམས་ལ། །ཆོས་དབྱིངས་འོད་གསལ་ཉོན་མོངས་མེད། །
en: “The luminous expanse of phenomena, Free of afflictions, is in all such phenomena.

source: འོ་ན་རབ་ཏུ་བྱུང་བའི་དོན། །
en: The point of going forth?

source: ཁྱོད་ཀྱིས་བདག་ལ་ཇི་སྐད་བརྗོད། །
en: So, will you please tell me

source: ཆོས་རྣམས་ཐམས་ཅད་ཐ་དད་མེད། །
en: “All phenomena are indistinct.

source: འདི་དག་བྲག་ཅ་འདྲ་བ་ཡིན། །
en: They are like an echo.

source: མཁས་པ་དེ་དག་ནམ་དུ་ཡང་། །
en: The sphere of the noble ones.

source: འཕགས་པའི་སྤྱོད་ཡུལ་རྟོག་མི་བྱེད། །
en: The wise never conceptualize

source: གཞན་མིན་མཚན་ཉིད་དེ་བཞིན་ཉིད། །
en: “Their characteristic is suchness and nothing else.

source: གཞན་དག་ཏུ་ནི་ཡོང་མི་འགྱུར། །
en: They never transform into other things.

source: ཆོས་རྣམས་འགྱུར་བ་མེད་པ་ལ། །རབ་བྱུང་བརྟགས་པས་ཅི་ཞིག་བྱ། །
en: Since phenomena are unchanging, What use is the concept of going forth?”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཁྱེའུ་རིན་ཆེན་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then Mañjuśrī­kumāra­bhūta asked Ratnadatta,

source: ཁྱེའུ་བྱང་ཆུབ་ཅེས་བྱ་བ་དེ་གང་གི་ཚིག་བླ་དགས་ཡིན།
en: “Child, what is ‘awakening’ a verbal designation for?”

source: རིན་ཆེན་བྱིན་གྱིས་སྨྲས་པ། འཇམ་དཔལ་བྱང་ཆུབ་ནི་ཚིག་གི་བླ་དགས་མེད་པའོ། །
en: “Mañjuśrī,” Ratnadatta replied, “awakening is devoid of verbal designations.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། ཁྱོད་ཅི་ལས་བསམས་ཏེ་དེ་སྐད་སྨྲ།
en: “How do you consider and verbally express it?” Mañjuśrī asked.

source: རིན་ཆེན་བྱིན་གྱིས་སྨྲས་པ། འཇམ་དཔལ་ཆོས་ཉིད་ནི་བསམ་དུ་མེད་པ་ཡིན་ན། དེ་བདག་གིས་འདི་ལྟར་བསམས་ཏེ་བསྟན་པར་བྱ།
en: Ratnadatta replied, “Mañjuśrī, since reality is inconceivable, I consider it as such and then express it.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། འདི་ལ་ལས་དང་པོ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཇི་ལྟར་གདམས་ངག་བསྟན་པར་བྱ།
en: Mañjuśrī asked, “How should beginner bodhisattvas be given instructions on this?

source: ཇི་ལྟར་རྗེས་སུ་བསྟན་པར་བྱ།
en: How should they be taught about it?”
